Revit 2022 API
AnalyticalDirection Enumeration
 Specifies a direction for manipulating analytical model.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
Syntax
C#
public enum AnalyticalDirection
Visual Basic
Public Enumeration AnalyticalDirection
Visual C++
public enum class AnalyticalDirection
Members
Member name | Description
Vertical |  Change in vertical direction only.
VerticalTop |  Vertical change, for top of Element's analytical model.
VerticalBottom |  Vertical change, for bottom of Element's analytical model.
Horizontal |  Change in horizontal direction only (no elevation change).
HorizontalStart |  Horizontal change, corresponding to start of Curve Driver.
HorizontalEnd |  Horizontal change, corresponding to end of Curve Driver.
Any |  Any change, including vertical and horizontal.
X |  Change in X direction
Y |  Change in Y direction
Z |  Change in Z direction
See Also
Autodesk.Revit.DB.Structure Namespace